let seen = 41

let kanjiString = `出来上がる, きつい, 仕切る, 際立つ, 頂く, 記入, 空欄, 詳しい, 部分, 所持金, 有り金, 持ち合わせ, 金額, 全部, 精々, 目が覚める, 日が差す, 飾る, 結構, 数人, 就く, 兼ねる, 是非, 新居, 書類, 伝言, 連絡, 積み重ねる, 世話をする, 役目, 演じる, 進歩, に於いて, 役割, 不可欠, 書き留める, 要点, 結局, 支払い, 要約, 論点, 主要, 同僚, 論文, 批評, 準備, 渡す, 業績, 技術, 力強い, 伝える, 眺め, 築き上げる, 過ごす, 決心, 活発, 受け入れる, 組み立てる, 与える, 動機, 基づく, 相違, 僅か, 至る所, 予算, 論理的, 議論, 宿題, 済ませる, 感心, 好き好き, に因って, 好み, 帰宅, 何人か, 笑わせる, 約, 数個, 最新, 商売, 追って, 日ごとに, 不平, 交通, 環境, 遅い;鈍い;晩い;遲い, 飛び去る, 的確;適確, 暫く, 幾つか, 一斉, に対して, 公共, 暗がり, 割り振る, 如何, 達す, 様子, 決定, 規則, 決まり, 時刻, 様, 晴天, 連続, 曲がりくねる, 続く, 具合, 喜ぶ;欣ぶ, 道理, 遠方, 旅人, 乗客, 財産, 成績, 賛成, 筈, 頼む;恃む;憑む, 両替, 両方, 運動靴, 深い, 深刻, 共同生活, 共感, 共有, 共用, 到来, 適度, と共に, 共通点, 見当, どう言う, 困難, 呼吸, 返事, 個人, 制度, 賜物, 成功, 幸せ;倖せ, 幸い, 現在, 通例, 表現, 直視, 重要性, 現代, 現金, 現状, 口の利き方, 方面, 目標, 解決, 潮;汐, 翌朝, 塔, 和服, 平和, 乗り出す, 当局, 原因, 範囲外, 依然として, 便り, に依る;に因る, 幸福, 団体, 不要, 参加, 流暢, 大量, 合格, 性格, 価格, 庭園, 学園, 遊園地, 示す, 機関, 男女, 貿易, 関連, 関する, 玄関, 物体, 頼り, 終局, 顔つき;顔付き, 笑顔, 横切る, 真剣, 辛うじて, 始発, 目下, 全身, 好む, 作動, 関わり合い, 合わせる;併せる, 似合う, 話し合う, 割合, 要するに, 利益, 習得;修得, 要領, 殆ど, 得, 書物, 日光, 得る;獲る, 得る, 心遣い, 申し上げる, 好意, に対し, 共に;倶に, 婦人, 夫婦, 多数, 欠席, 出席, 差別, 声明, 同意, 言い分, 後, 繰り返す, 表通り, 表す;現す;表わす;現わす;顕す, 表面, 手段, 秒読み, 用心, 遂に, 予報, 愛情, 友情, 感情, 表情, 夕べ;昨夜, 夜中, 適用, 作成, 作法, 作戦, 数字, 経験者, 経験, 本音, 都合, 楽しみ, 言わずもがな, 過去, 勤勉, 考え方, 信用, 活用, 処理, 理解, 練習, 習慣, 予習, 理由, 通じる, 分野, 共通, 途中, 返答, 工場, 本館, 会館, 試す, 着く, 到着, 最前列, 結果, 状況, 全体的, 予想, 要素, 利用, 有らゆる, 有利, 有り難う;有難う, 有効, 有能, 応じる, 依頼, 長年, 仕舞う, 仕舞った, 寝台, 前方, 心当たり, 相当, 適当, 主客, 観客, 予期, 際, 冷静, 選択, 気づく;気付く, 現場, 暮らす, 訪ねる, 振る舞い, 態度, 芝居がかる, 引っ越し, 字引, 演説, 引用, 素晴らしい;素晴しい, 早速, 早急, 出来るだけ, 可能, 非常, 思考, 物質, 良質, 不可能, 立派, 見事, 扱う, 努力, 集中, 求める, 機能, 対象, 例, 未知, 心得る, 被害, 収入, 交付, 予約, 体温, 一生, 見学, 閉館, 月光, 得意, 複数, 物音, 手立て, 費用, 現れる;現われる;表れる, に関して, 割り当てる;割当てる, 研究, 行事, 相談, 絶好, 逃す, 非合理的, 歌詞, 自発的, 今月末, 関心, 中心, 屋外, 待合室, 価値, 地域, 差し上げる, 悲劇, 細かい, 興味, 信頼, 対等, 絶対, 任務, 対処, 責任, 需要, に対する, 先約, 下記, 作品, 生活費, 遊学, 程度, 生産, 指名, 訪れる, 放課後, 通う, 握手, 片付ける, 家屋, 自身, 手短, 確実, 退席, 適切, 熱心, 憧れる, 抱きしめる, 名案, 思い出, 正午, 何奴も此奴も, 正確, 最良, 納得, 規制, 正体, 既に;已に, 見舞い;見舞, 寄付;寄附, 関心事, 平均, 文頭, 煩雑, 彫琢, 細部, 教え込む, 徹底的, 注文, 比較, 解釈, 間もなく;間も無く, 手元, 開発元, 来客, 近日中に, 見なす, 良好, 比べる, 付近, 目覚ましい, 調子, 最近, 知識, 地理, 支店, 展開, 実演, 居間, 効果, 投入, 置き忘れる, 太陽, 陽気, 見積もり;見積り, 到頭, 一緒, 恐らく, 抱負, 大部分, 遅刻, 更に, 前倒し, 居眠り, 招待, 面倒, 居合わせる, 反対, 再び, 絶望, ご存じ, 左右, 申し出, 性能, 才能, 今しがた;今し方, 度々, ある程度, 大学教育, 常識, 日用品, 早退, や否や, 主に, はけ口, 練習試合, 馬上槍試合, 親善試合, 警告試合, 消化試合, 選手権試合, 遺恨試合, ボクシングの試合, 試合巧者, 御前試合, 対校試合, 試合開始, 完全試合, 無気力試合, 指名試合, 試合に敗れる, 大試合, 他流試合, 交流試合, 単試合, 没収試合, 野試合, 複試合, 再試合, 無観客試合, 好試合, 対抗試合, 試合場, 紅白試合, 天覧試合, 公式試合, 壮行試合, 凡試合, 試合終了, 模範試合, 各地, 名声, 存続, 余地, 単位, 地面, 土地, 重要, 人気, 良く, 期待, 待ち合わせる, 教科書, 心ゆくまで, 読書, 行き先, 中止, 思いがけない, 幸運, 勧める;薦める;奨める, 職場, 市場, 場所, 場合, やり方, 方々, 方向, 方法, 仕方, 夕方, 実業, 業種, 失業, 職業, 作業, 工業, 産業, 地位, 地区, 地球, 地方, 出席者, 利用者, 責任者, 労働者, 医者, 発明, 出発, 発見, 発表, 発音, 無料, 観光客, 運動, 自信, どんどん, 関係, 議事, 止める;已める, 計画, 変化, 上手い;美味い;旨い;巧い;甘い, 万事, 自給, 自動的, 自体, 自宅, 自習, 自然, 自転車, 自動車, 出来事, 食事, 事務, 事情, 事件, 記事, 用事, 同一, 魚屋, 次週, 前週, 週明け, 一週間, 先週, 買収, 満足, 不足, 足す, 足りる, 空き, 空港, 利口, 歩道, 道路, 道具, 安定, 多少, 言語, 言葉, お目出度う, 科目;課目, 目的, 手紙, 私立, 立場, 役に立つ, 新た, 出会う;出合う;出遭う, 会話, 機会, 大事, 事務所, 仕事, 作り上げる, 特有, 同様, 試合, 景気, 食う;喰う;啖う, 自動, 朝食, 何種類, 様々, 生徒, 最後, 試験, 起こる, 特別, 訪問, 当時, 情報, 週間, 以来, 海外, 後半, 予定, 週末, 商品, 活気, 存在, 共同;協同, 商店, 以前, 食品, 近所
`
console.log()
const wordList = kanjiString.split(', ');

let data = '';
let group = '';
function fun (word) {
  window.open(`https://jisho.org/search/${word}%23kanji`,'_newtab');

}

for (let [idx, word] of Object.entries(wordList)) {
	let spanStyle='';
    if(idx % 10 == 0) {
    	data += `<div>${group}</div>`;
        group = '';
    }
  	if(idx %10 === 0 && idx < seen)
  		spanStyle = 'color:purple;!important'
	group += `<a
    	oncontextmenu="javascript:fun('${word}');return false;"
    	target="_blank"
    	href="https://jisho.org/search/${word}%23sentence"> <span style="${spanStyle}">${idx}</span> ${word}</a>`;
}
console.log(data)
document.querySelector('#kanji').innerHTML = data;

let joyuData = '';

for (let index = 1; index <= 4; index++) {
  joyuData += `
    <a
      target="_blank"
      href="https://jisho.org/search/%23kanji%20%23jlpt-n5?page=${index}"> Joyo #${index}
    </a>`;
}
document.querySelector('#joyo1').innerHTML = joyuData;
joyuData = '';

for (let index = 1; index <= 9; index++) {
  joyuData += `
    <a
      target="_blank"
      href="https://jisho.org/search/%23kanji%20%23jlpt-n4?page=${index}"> Joyo #${index}
    </a>`;
}
document.querySelector('#joyo2').innerHTML = joyuData;
joyuData = '';

for (let index = 1; index <= 10; index++) {
  joyuData += `
    <a
      target="_blank"
      href="https://jisho.org/search/%23kanji%20%23jlpt-n3?page=${index}"> Joyo #${index}
    </a>`;
  
}

document.querySelector('#joyo3').innerHTML = joyuData;

